dgryzunov/Подписки/InformationRegisters/ОтсутствиеСотрудникаАстон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОтсутствиеСотрудникаАстон</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаОтсутствия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончанияОтсутствия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

dgryzunov/Подписки/Documents/БольничныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>БольничныйЛист</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

dgryzunov/Подписки/Documents/Отпуск.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Отпуск</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачалаОсновногоОтпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияОсновногоОтпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

dgryzunov/Подписки/Documents/Увольнение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Увольнение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

dgryzunov/Подписки/CommonModules/ОР_РаботаСРегистромОтсутствиеСотрудникаАстон/Ext/Module.bsl
Процедура ОР_ПодпискаНаСобытиеОтсутствиеСотрудникаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Запрос = Новый Запрос;
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.БольничныйЛист") Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		//|	БольничныйЛист.Дата КАК Период,
		|	БольничныйЛист.Сотрудник КАК Сотрудник,
		|	БольничныйЛист.ДатаНачала КАК ДатаНачалаОтсутствия,
		|	БольничныйЛист.ДатаОкончания КАК ДатаОкончанияОтсутствия,
		|	РАЗНОСТЬДАТ(БольничныйЛист.ДатаНачала, БольничныйЛист.ДатаОкончания, ДЕНЬ) + 1 КАК КоличествоДней
		|ИЗ
		|	Документ.БольничныйЛист КАК БольничныйЛист
		|ГДЕ
		|	БольничныйЛист.Ссылка = &Ссылка";
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.Отпуск") Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		//|	Отпуск.Дата КАК Период,
		|	Отпуск.Сотрудник КАК Сотрудник,
		|	Отпуск.ДатаНачалаОсновногоОтпуска КАК ДатаНачалаОтсутствия,
		|	Отпуск.ДатаОкончанияОсновногоОтпуска КАК ДатаОкончанияОтсутствия,
		|	РАЗНОСТЬДАТ(Отпуск.ДатаНачалаОсновногоОтпуска, Отпуск.ДатаОкончанияОсновногоОтпуска, ДЕНЬ) + 1 КАК КоличествоДней
		|ИЗ
		|	Документ.Отпуск КАК Отпуск
		|ГДЕ
		|	Отпуск.Ссылка = &Ссылка"	
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Увольнение.Сотрудник КАК Сотрудник,
		|	Увольнение.ДатаУвольнения КАК ДатаНачалаОтсутствия,
		|	Увольнение.ДатаУвольнения КАК ДатаОкончанияОтсутствия
		|ИЗ
		|	Документ.Увольнение КАК Увольнение
		|ГДЕ
		|	Увольнение.Ссылка = &Ссылка"
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МенеджерЗаписи = РегистрыСведений.ОтсутствиеСотрудникаАстон.СоздатьМенеджерЗаписи();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//Проверяем наличие записи в регистре
		МенеджерЗаписи.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		МенеджерЗаписи.ДатаНачалаОтсутствия = ВыборкаДетальныеЗаписи.ДатаНачалаОтсутствия;
		МенеджерЗаписи.ДатаОкончанияОтсутствия = ВыборкаДетальныеЗаписи.ДатаОкончанияОтсутствия;
		МенеджерЗаписи.Прочитать();
		//Если запись отсутствует - записываем
		Если НЕ МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			МенеджерЗаписи.ДатаНачалаОтсутствия = ВыборкаДетальныеЗаписи.ДатаНачалаОтсутствия; 
			МенеджерЗаписи.ДатаОкончанияОтсутствия = ВыборкаДетальныеЗаписи.ДатаОкончанияОтсутствия;
			Если ТипЗнч(Источник) = Тип("ДокументОбъект.БольничныйЛист") ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.Отпуск") Тогда
				МенеджерЗаписи.КоличествоДней = ВыборкаДетальныеЗаписи.КоличествоДней;
			Иначе
				МенеджерЗаписи.КоличествоДней = 0;
			КонецЕсли;	
			МенеджерЗаписи.Записать(Ложь);
		//Если запись есть - пропускаем	
		Иначе 
			Продолжить;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
